In [2]:
!ls ../raw_data/

holidays_events.csv  sample_submission.csv  test.csv   transactions.csv
oil.csv		     stores.csv		    train.csv

In [3]:
import pandas as pd

In [5]:
train_data = pd.read_csv('../raw_data/train.csv')
test_data = pd.read_csv('../raw_data/test.csv')
holiday_data = pd.read_csv('../raw_data/holidays_events.csv')
oil_data = pd.read_csv('../raw_data/oil.csv')

stores_data = pd.read_csv('../raw_data/stores.csv')
transactions_data = pd.read_csv('../raw_data/transactions.csv')

In [6]:
train_data.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [18]:
train_data['sales'].sort_values()

0               0.000
1899470         0.000
813143          0.000
1899467         0.000
1899466         0.000
              ...
2153031     63434.000
2139699     76090.000
2144154     87438.516
2445984     89576.360
2163723    124717.000
Name: sales, Length: 3000888, dtype: float64

In [19]:
train_data['onpromotion'].sort_values()

0            0
1727419      0
1727420      0
1727422      0
1727424      0
          ...
2213058    719
2188110    720
2211276    722
2200584    726
2216622    741
Name: onpromotion, Length: 3000888, dtype: int64

In [7]:
test_data.head()

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

In [11]:
oil_data.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [15]:
oil_data.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [17]:
oil_data['dcoilwtico'].sort_values()

812     26.19
796     26.68
811     27.54
810     27.96
795     28.47
        ...
1079      NaN
1118      NaN
1149      NaN
1174      NaN
1175      NaN
Name: dcoilwtico, Length: 1218, dtype: float64

In [9]:
holiday_data.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [13]:
stores_data.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [14]:
stores_data.count()

store_nbr    54
city         54
state        54
type         54
cluster      54
dtype: int64